# Yusuf Arico Pratama | yusufarcp@gmail.com

1. Pada Tugas No. 1 ini kita akan melakukan sedikit manipulasi data set. Data set yang kita manipulasi adalah dataset yang berasal dari data customers dan orders. 

Tujuan akhirnya adalah kita ingin melihat customers dan order yang dia lakukan dalam satu dataset agar selanjutnya lebih mudah dilakukan pengolahan

In [3]:
#import semua library dan package yang dibutuhkan disini
import warnings
warnings.filterwarnings('ignore')

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
#baca dan masukkan data dari setiap berkas ke dalam dataframenya masing-masing
#tampilkan 5 data awal dari setiap dataset dan juga tipe data dari setiap kolomnya
dfc = pd.read_csv('customers.csv', delimiter=';')
dfo = pd.read_csv('orders.csv', delimiter=';')

In [28]:
print('Data Customers')
dfc.head()

Data Customers

,userid,lastname,firstname,phone,address,city,country
0,103,Schmitt,Carine,40.32.2555,"54, rue Royale",Nantes,France
1,112,King,Jean,7025551838,8489 Strong St.,Las Vegas,USA
2,114,Ferguson,Peter,03 9520 4555,636 St Kilda Road,Melbourne,Australia
3,119,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",Nantes,France
4,121,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,Stavern,Norway

In [29]:
print('Data Orders')
dfo.head()

Data Orders

   ordernumber   orderdate  userid
0        10101  09/01/2003     128
1        10103  29/01/2003     121
2        10104  31/01/2003     141
3        10105  11/02/2003     145
4        10107  24/02/2003     131

In [30]:
print('Tipe Data Customers')
dfc.dtypes

Tipe Data Customers

userid        int64
lastname     object
firstname    object
phone        object
address      object
city         object
country      object
dtype: object

In [42]:
print('Tipe Data Orders')
dfo.dtypes

Tipe Data Orders

ordernumber     int64
orderdate      object
userid          int64
dtype: object

In [41]:
#sekarang kita lakukan join pada dataset kita berdasarkan pada userid. cari data yang memiliki irisan/kesamaan dari kedua dataset
gabung2 = pd.merge(dfc,dfo, on='userid', how='outer')
gabung2.head()

,userid,lastname,firstname,phone,address,city,country,ordernumber,orderdate
0,103,Schmitt,Carine,40.32.2555,"54, rue Royale",Nantes,France,10123.0,20/05/2003
1,103,Schmitt,Carine,40.32.2555,"54, rue Royale",Nantes,France,10298.0,27/09/2004
2,103,Schmitt,Carine,40.32.2555,"54, rue Royale",Nantes,France,10345.0,25/11/2004
3,112,King,Jean,7025551838,8489 Strong St.,Las Vegas,USA,10124.0,21/05/2003
4,112,King,Jean,7025551838,8489 Strong St.,Las Vegas,USA,10278.0,06/08/2004

2. Jelaskan dengan sederhana apa yang dimaksud dengan algoritma K-Means pada Unsupervised Learning. 

Jelaskan pula bagaimana cara kerja algoritma tersebut.

Jelaskan dengan bahasa kalian

#isikan jawaban no.2 pada sel ini

Algoritma K-Means merupakan salah satu bagian dari Unsupervised Machine Learning yang menerapkan sistem clustering

Cara kerja algoritma ini diawali dengan menentukan jumlah/banyak cluster yang ingin kita pakai, setelah itu kita juga perlu mengetahui posisi centroid data secara random. kemudian kita juga perlu menghitung jarak antara data pont terhadap posisi centroid, hal ini dapat dibantu dengan metode euclidean distance. langkah selanjutnya yaitu menghitung ulang centroid berdasarkan label-label data sebelumnya. Disini kita buat kembali centroid baru dan menghitung kembali jarak antar data poin ke centroid. tahap terakhir yaitu Kemudian di assign kembali data poin ke centroid terdekat yang terbaru, dan kita cek apakah ada perubahan dalam cluster atau tidak, jika ada maka kita perlu kembali langkah sebelumnya untuk mencari posisi centroid yang tidak mengubah cluster. Hal ini kita lakukan perulangan sampai posisi centroid tidak berubah lagi. 

Untuk menentukan jumlah cluster yang tepat, kita dapat menggunakan elbow method. metode ini bekerja dengan cara membandingkan jumlah kluster dengan inersianya.